DENCODE31/environmental-monitoring-station/sdkconfig.defaults
# Valores base del proyecto (reproducibles en cualquier clon).
# sdkconfig se regenera a partir de aquí; no se versiona.

# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash 2 MB
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"

# Tabla de particiones: app grande (~1.5 MB) — el binario con TLS+mDNS+HTTP
# supera el 1 MB de la tabla single_app por defecto.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_large.csv"

# OLED SSD1306 (componente vendorizado en components/ssd1306)
CONFIG_I2C_INTERFACE=y
CONFIG_SSD1306_128x64=y
CONFIG_OFFSETX=0
CONFIG_FLIP=n
CONFIG_I2C_PORT_0=y
CONFIG_SDA_GPIO=21
CONFIG_SCL_GPIO=22
CONFIG_RESET_GPIO=-1
